'use client'
import LandingPage from '@/components/templates/LandingPage'
import React, { useState } from 'react'
import Planning from "@/assets/images/planning.jpg"
import { planning } from '@/components/constant/Projects'
import Image from 'next/image'
import PDF from "@/assets/images/icon/pdf.png"
import Modal from '@/components/templates/Modal'

export default function Page() {
    const [showModal, setShowModal] = useState(false)
    return (
        <div className='font-bahij overflow-x-hidden'>
            <LandingPage image={Planning} title='التخطيط التنموي' />
            <section className='p-[5%] flex flex-wrap justify-end items-center gap-5'>
                {planning?.map((value: string, id: number) => (
                    <div onClick={() => setShowModal(true)} className='flex justify-between items-center shadow-xl rounded-xl border border-base text-right  px-4 py-6 xl:w-[32%] md:w-[45%] h-[100%] hover:scale-105 transition-all ease-in-out duration-300 cursor-pointer'>
                        <Image src={PDF} alt='' className='w-[15%]' />
                        <h1 className='text-xl'>{value}</h1>
                    </div>
                ))}
            </section>
            <Modal show={showModal} close={() => setShowModal(false)} title='تفاصيل المشروع' scroll>
                <div className='text-right font-light space-y-3'>
                    <p>لكن يجب أن أشرح لك كيف ولدت كل هذه الفكرة الخاطئة المتمثلة في إدانة اللذة وتمجيد الألم، وسأقدم لك وصفًا كاملاً للنظام، وأشرح التعاليم الفعلية لمستكشف الحقيقة العظيم، سيد بناء الإنسان. سعادة. لا أحد يرفض أو يكره أو يتجنب المتعة نفسها، لأنها متعة، ولكن لأن أولئك الذين لا يعرفون كيفية السعي وراء المتعة بعقلانية يواجهون عواقب مؤلمة للغاية. ومرة أخرى لا يوجد أي شخص يحب أو يسعى أو يرغب في الحصول على الألم في حد ذاته، لأنه ألم، ولكن لأنه في بعض الأحيان تحدث ظروف يمكن فيها للكدح والألم أن يجلب له بعض المتعة العظيمة. لنأخذ مثالاً تافهًا، من منا يقوم بتمارين بدنية شاقة، إلا للحصول على بعض الفائدة منها؟ ولكن من له الحق في أن يلوم إنساناً اختار أن يستمتع بلذة لا عواقب لها، أو إنساناً يتجنب ألماً لا ينتج عنه متعة؟</p>
                    <p>في الواقع، يتهمون ويوستو أوديو كرامة دوسيموس بأن الإغراءات المتعمدة تلحق الضرر بالفاسدين الذين يعانون من الآلام وما شابه ذلك من إزعاجات باستثناء حالات لا ترغب في توفيرها، تمامًا كما هو الحال في الذنب الذي يحرمه المكتب من الآلام، وهو العمل والألم الغاضب. وهذا أمر سهل للغاية وهو يتميز بالسرعة. في الوقت الحالي، مع الحل الجديد هو خيار أنيق لا يوجد عائق فيه ناقص هوية الحد الأقصى الذي يمكن أن يضعه الشخص، كل ما هو متوقع هو كل الألم الطارد. الوقت أو الرفض أو الديون الرسمية أو الحاجة إلى اتخاذ إجراءات ضرورية حتى لا يتم رفضها وعدم التسبب في أي اعتراضات. إنه يرمي إلى حثه على التفكير في ذوق ذكي، أو الحصول على  الاسم المستعار.</p>
                    <p>من ناحية أخرى، فإننا ندين بسخط عادل ونكره الرجال الذين خدعتهم سحر متعة هذه اللحظة وأحبطتهم، وأعمتهم الرغبة، لدرجة أنهم لا يستطيعون التنبؤ بالألم والمتاعب التي لا بد أن تترتب على ذلك؛ واللوم متساوٍ على من يقصر في أداء واجبه بسبب ضعف الإرادة، وهو كالقول من خلال التقلص من الكدح والألم. هذه الحالات بسيطة تمامًا وسهلة التمييز. في ساعة حرة، عندما تكون قدرتنا على الاختيار غير مقيدة، وعندما لا شيء يمنعنا من القيام بما نحب أكثر، فإننا نرحب بكل متعة ونتجنب كل ألم. ولكن في ظروف معينة، وبسبب مطالبات الواجب أو التزامات العمل، كثيرًا ما يحدث أنه يجب التنصل من الملذات وقبول الإزعاجات. ولذلك فإن الرجل الحكيم يتمسك دائمًا في هذه الأمور بمبدأ الاختيار هذا: فهو يرفض الملذات ليحصل على متع أخرى أكبر، أو يتحمل الآلام لتجنب آلام أسوأ.</p>
                </div>
            </Modal>
        </div>
    )
}
