export const markers = [
    {position: {lat:-8.511342672890647,lng:116.09913964667497}, title:"مسجد صهيب الرومي", type:1},
    {position:{lat:-8.565805151490231, lng:116.62021483068882}, title:"مركز بدر يعقوب الباقر", type:2},
    {position:{lat:-8.590650258180917, lng:116.113693658673}, title:"مركز فوز الكويت و مركز الدخيل (معهد أبو هريرة الإسلامي)", type:3},
    {position:{lat:-8.589889104783952, lng:116.09626101071883}, title:"مركز فوز الكويت", type:1},
    {position:{lat:-8.568904619111844, lng:116.09700632421021}, title:"مركز المعلمة لطيفة محمد فهد المالك",type:2}
  ]